<a href="https://colab.research.google.com/github/HimanshuSahoo/Himanshu_Python/blob/main/Naive_Bayes_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("SalaryData_Test.csv")

In [3]:
df

       age      workclass      education  ...  hoursperweek          native  Salary
0       25        Private           11th  ...            40   United-States   <=50K
1       38        Private        HS-grad  ...            50   United-States   <=50K
2       28      Local-gov     Assoc-acdm  ...            40   United-States    >50K
3       44        Private   Some-college  ...            40   United-States    >50K
4       34        Private           10th  ...            30   United-States   <=50K
...    ...            ...            ...  ...           ...             ...     ...
15055   33        Private      Bachelors  ...            40   United-States   <=50K
15056   39        Private      Bachelors  ...            36   United-States   <=50K
15057   38        Private      Bachelors  ...            50   United-States   <=50K
15058   44        Private      Bachelors  ...            40   United-States   <=50K
15059   35   Self-emp-inc      Bachelors  ...            60   United-States    >50K

[15060 rows x 14 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15060 entries, 0 to 15059
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            15060 non-null  int64
 1   workclass      15060 non-null  object
 2   education      15060 non-null  object
 3   educationno    15060 non-null  int64
 4   maritalstatus  15060 non-null  object
 5   occupation     15060 non-null  object
 6   relationship   15060 non-null  object
 7   race           15060 non-null  object
 8   sex            15060 non-null  object
 9   capitalgain    15060 non-null  int64
 10  capitalloss    15060 non-null  int64
 11  hoursperweek   15060 non-null  int64
 12  native         15060 non-null  object
 13  Salary         15060 non-null  object
dtypes: int64(5), object(9)
memory usage: 1.6+ MB

In [5]:
df.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  15060.000000  15060.000000  15060.000000  15060.000000  15060.000000
mean      38.768327     10.112749   1120.301594     89.041899     40.951594
std       13.380676      2.558727   7703.181842    406.283245     12.062831
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       48.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   3770.000000     99.000000

In [6]:
df.shape

(15060, 14)

In [7]:
df.isna().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [8]:
df.columns

Index(['age', 'workclass', 'education', 'educationno', 'maritalstatus',
       'occupation', 'relationship', 'race', 'sex', 'capitalgain',
       'capitalloss', 'hoursperweek', 'native', 'Salary'],
      dtype='object')

In [9]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df['workclass']=le.fit_transform(df['workclass'])
df['education']=le.fit_transform(df['education'])
df['maritalstatus']=le.fit_transform(df['maritalstatus'])
df['occupation']=le.fit_transform(df['occupation'])
df['relationship']=le.fit_transform(df['relationship'])
df['race']=le.fit_transform(df['race'])
df['sex']=le.fit_transform(df['sex'])
df['native']=le.fit_transform(df['native'])
df.head()

   age  workclass  education  ...  hoursperweek  native  Salary
0   25          2          1  ...            40      37   <=50K
1   38          2         11  ...            50      37   <=50K
2   28          1          7  ...            40      37    >50K
3   44          2         15  ...            40      37    >50K
4   34          2          0  ...            30      37   <=50K

[5 rows x 14 columns]

In [10]:
x=df.iloc[:,:13]
y=df.iloc[:,-1]

In [11]:
from sklearn import preprocessing
#normalize data
x=preprocessing.StandardScaler().fit_transform(x)
x[0:13]

array([[-1.02900513, -0.222347  , -2.42343884, -1.2165628 ,  0.93318745,
         0.00272543,  1.00610775, -2.03438913,  0.69583225, -0.14543845,
        -0.2191694 , -0.07888904,  0.26058067],
       [-0.05742253, -0.222347  ,  0.19017232, -0.43489824, -0.39546327,
        -0.49478949, -0.88198978,  0.38223023,  0.69583225, -0.14543845,
        -0.2191694 ,  0.75013125,  0.26058067],
       [-0.80479376, -1.25712632, -0.85527215,  0.73759862, -0.39546327,
         0.99775528, -0.88198978,  0.38223023,  0.69583225, -0.14543845,
        -0.2191694 , -0.07888904,  0.26058067],
       [ 0.39100021, -0.222347  ,  1.23561678, -0.04406595, -0.39546327,
         0.00272543, -0.88198978, -2.03438913,  0.69583225,  0.85262384,
        -0.2191694 , -0.07888904,  0.26058067],
       [-0.35637102, -0.222347  , -2.68479996, -1.60739509,  0.93318745,
         0.25148289, -0.25262394,  0.38223023,  0.69583225, -0.14543845,
        -0.2191694 , -0.90790934,  0.26058067],
       [ 1.81100556,  1.84721163,  0.97425567,  1.91009547, -0.39546327,
         0.74899782, -0.88198978,  0.38223023,  0.69583225,  0.25739549,
        -0.2191694 , -0.74210528,  0.26058067],
       [-1.10374225, -0.222347  ,  1.23561678, -0.04406595,  0.93318745,
         0.25148289,  1.63547359,  0.38223023, -1.43712799, -0.14543845,
        -0.2191694 , -0.07888904,  0.26058067],
       [ 1.21310857, -0.222347  , -1.37799438, -2.38905966, -0.39546327,
        -0.99230442, -0.88198978,  0.38223023,  0.69583225, -0.14543845,
        -0.2191694 , -2.56594993,  0.26058067],
       [ 1.9604798 , -0.222347  ,  0.19017232, -0.43489824, -0.39546327,
         0.00272543, -0.88198978,  0.38223023,  0.69583225,  0.68775143,
        -0.2191694 , -0.07888904,  0.26058067],
       [-0.20689677, -2.29190564, -0.33254991,  1.1284309 , -0.39546327,
        -1.48981934, -0.88198978,  0.38223023,  0.69583225, -0.14543845,
        -0.2191694 , -0.07888904,  0.26058067],
       [-0.95426801, -0.222347  ,  0.19017232, -0.43489824,  0.93318745,
        -1.48981934, -0.25262394,  0.38223023, -1.43712799, -0.14543845,
        -0.2191694 , -0.16179107,  0.26058067],
       [ 0.68994871, -0.222347  ,  0.19017232, -0.43489824, -0.39546327,
         0.00272543, -0.88198978,  0.38223023,  0.69583225,  0.25739549,
        -0.2191694 ,  0.58432719,  0.26058067],
       [ 0.31626309, -0.222347  ,  0.45153343,  1.51926319, -0.39546327,
        -0.74354695, -0.88198978,  0.38223023,  0.69583225, -0.14543845,
        -0.2191694 ,  0.75013125,  0.26058067]])

In [12]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=1)
y_test.shape

(4518,)

In [13]:
import sklearn
from sklearn.naive_bayes import BernoulliNB
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB
from sklearn import metrics
from sklearn.metrics import accuracy_score

In [14]:
BernNB=BernoulliNB(binarize=True)
BernNB.fit(x_train,y_train)
print(BernNB)
y_expect=y_test

BernoulliNB(alpha=1.0, binarize=True, class_prior=None, fit_prior=True)

In [15]:
y_pred=BernNB.predict(x_test)

In [16]:
y_pred

array([' <=50K', ' >50K', ' <=50K', ..., ' <=50K', ' >50K', ' <=50K'],
      dtype='<U6')

In [17]:
accuracy_score(y_expect,y_pred)

0.7656042496679947

In [18]:
GausNB=GaussianNB()
GausNB.fit(x_train,y_train)
y_pred=GausNB.predict(x_test)
accuracy_score(y_expect,y_pred)

0.8012394864984507

In [19]:
y_pred

array([' <=50K', ' >50K', ' <=50K', ..., ' <=50K', ' <=50K', ' <=50K'],
      dtype='<U6')

In [20]:
BernNB=BernoulliNB(binarize=0.1)
BernNB.fit(x_train,y_train)
print(BernNB)
y_expect=y_test

y_pred=BernNB.predict(x_test)

BernoulliNB(alpha=1.0, binarize=0.1, class_prior=None, fit_prior=True)

In [21]:
accuracy_score(y_expect,y_pred)

0.7841965471447543

In [22]:
df2=pd.read_csv("SalaryData_Train.csv")

In [23]:
df2

       age          workclass  ...          native  Salary
0       39          State-gov  ...   United-States   <=50K
1       50   Self-emp-not-inc  ...   United-States   <=50K
2       38            Private  ...   United-States   <=50K
3       53            Private  ...   United-States   <=50K
4       28            Private  ...            Cuba   <=50K
...    ...                ...  ...             ...     ...
30156   27            Private  ...   United-States   <=50K
30157   40            Private  ...   United-States    >50K
30158   58            Private  ...   United-States   <=50K
30159   22            Private  ...   United-States   <=50K
30160   52       Self-emp-inc  ...   United-States    >50K

[30161 rows x 14 columns]

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15060 entries, 0 to 15059
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            15060 non-null  int64
 1   workclass      15060 non-null  int64
 2   education      15060 non-null  int64
 3   educationno    15060 non-null  int64
 4   maritalstatus  15060 non-null  int64
 5   occupation     15060 non-null  int64
 6   relationship   15060 non-null  int64
 7   race           15060 non-null  int64
 8   sex            15060 non-null  int64
 9   capitalgain    15060 non-null  int64
 10  capitalloss    15060 non-null  int64
 11  hoursperweek   15060 non-null  int64
 12  native         15060 non-null  int64
 13  Salary         15060 non-null  object
dtypes: int64(13), object(1)
memory usage: 1.6+ MB

In [25]:
df.shape

(15060, 14)

In [26]:
df.describe()

                age     workclass  ...  hoursperweek        native
count  15060.000000  15060.000000  ...  15060.000000  15060.000000
mean      38.768327      2.214874  ...     40.951594     35.467596
std       13.380676      0.966422  ...     12.062831      5.880922
min       17.000000      0.000000  ...      1.000000      0.000000
25%       28.000000      2.000000  ...     40.000000     37.000000
50%       37.000000      2.000000  ...     40.000000     37.000000
75%       48.000000      2.000000  ...     45.000000     37.000000
max       90.000000      6.000000  ...     99.000000     39.000000

[8 rows x 13 columns]

In [27]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df2['workclass']=le.fit_transform(df2['workclass'])
df2['education']=le.fit_transform(df2['education'])
df2['maritalstatus']=le.fit_transform(df2['maritalstatus'])
df2['occupation']=le.fit_transform(df2['occupation'])
df2['relationship']=le.fit_transform(df2['relationship'])
df2['race']=le.fit_transform(df2['race'])
df2['sex']=le.fit_transform(df2['sex'])
df2['native']=le.fit_transform(df2['native'])
df2.head()

   age  workclass  education  ...  hoursperweek  native  Salary
0   39          5          9  ...            40      37   <=50K
1   50          4          9  ...            13      37   <=50K
2   38          2         11  ...            40      37   <=50K
3   53          2          1  ...            40      37   <=50K
4   28          2          9  ...            40       4   <=50K

[5 rows x 14 columns]

In [28]:
x=df2.iloc[:,:13]
y=df2.iloc[:,-1]

In [29]:
x

       age  workclass  education  ...  capitalloss  hoursperweek  native
0       39          5          9  ...            0            40      37
1       50          4          9  ...            0            13      37
2       38          2         11  ...            0            40      37
3       53          2          1  ...            0            40      37
4       28          2          9  ...            0            40       4
...    ...        ...        ...  ...          ...           ...     ...
30156   27          2          7  ...            0            38      37
30157   40          2         11  ...            0            40      37
30158   58          2         11  ...            0            40      37
30159   22          2         11  ...            0            20      37
30160   52          3         11  ...            0            40      37

[30161 rows x 13 columns]

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=1)
y_test.shape

(9049,)

In [31]:
import sklearn
from sklearn.naive_bayes import BernoulliNB
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB
from sklearn import metrics
from sklearn.metrics import accuracy_score

In [32]:
BernNB=BernoulliNB(binarize=True)
BernNB.fit(x_train,y_train)
print(BernNB)
y_expect=y_test

y_pred=BernNB.predict(x_test)

BernoulliNB(alpha=1.0, binarize=True, class_prior=None, fit_prior=True)

In [33]:
y_pred

array([' <=50K', ' <=50K', ' <=50K', ..., ' <=50K', ' <=50K', ' <=50K'],
      dtype='<U6')

In [34]:
accuracy_score(y_expect,y_pred)

0.778649574538623

In [35]:
GausNB=GaussianNB()
GausNB.fit(x_train,y_train)
y_pred=GausNB.predict(x_test)
accuracy_score(y_expect,y_pred)

0.7898110288429661

In [36]:
BernNB=BernoulliNB(binarize=0.1)
BernNB.fit(x_train,y_train)
print(BernNB)
y_expect=y_test

y_pred=BernNB.predict(x_test)

BernoulliNB(alpha=1.0, binarize=0.1, class_prior=None, fit_prior=True)

In [37]:
accuracy_score(y_expect,y_pred)

0.7232843408111393